
/*********************************************************************************************
* File name	: frequency_struct.h
* HardWare	: STM32F103VBT 
* Author		: Lius
* History		:	none
*	Data			:	2014-06-07
* Descript	: STM32F103VBT 采集器，采集频率结构体
*********************************************************************************************/
#ifndef __FREQUENCY_STRUCT_H
#define __FREQUENCY_STRUCT_H


/*------------------------------------------------------------------------------------------*/
/*	 								include files						 				    																		*/
/*------------------------------------------------------------------------------------------*/

#include <stdint.h>
#include <stm32f10x_conf.h>

/*------------------------------------------------------------------------------------------*/
/*	 								struct files						 				    																		*/
/*------------------------------------------------------------------------------------------*/

typedef struct
{
	uint16_t head;//头
	uint16_t Fre[16];//存储十六路输入口的AD或者fre统计数据
	uint16_t AD[16];//存储十六路输入口的AD或者fre统计数据
	uint32_t count[16];//存储十六路输入口频率统计计数和
	uint16_t sel;//存储十六路输入口的高低电平情况
	uint16_t tail;//尾
}DataStruct;

typedef struct
{
	uint16_t clearFreCount;//是否清除端口计数
	uint16_t SEL;//控制SEL模块
	uint8_t outPut;//output端口电位控制
}RcvData;
#endif
